fullname = ["Антонов", "Ярослав", "Геннадьевич"]

print("Фамилия:", fullname[0])
print("Имя:", fullname[1])
print("Отчество:", fullname[2])

fullname = {
    "фамилия": "Антонов",
    "имя": "Ярослав",
    "отчество": "Геннадьевич"
}

print("Фамилия:", fullname["фамилия"])
print("Имя:", fullname["имя"])
print("Отчество:", fullname["отчество"])

import random

people = [
    {"фамилия": "Иванов", "имя": "Иван", "отчество": "Иванович"},
    {"фамилия": "Петров", "имя": "Петр", "отчество": "Петрович"},
    {"фамилия": "Сидоров", "имя": "Сидор", "отчество": "Сидорович"},
    {"фамилия": "Козлов", "имя": "Константин", "отчество": "Константинович"},
    {"фамилия": "Смирнов", "имя": "Сергей", "отчество": "Сергеевич"}
]

print("ФИО с фамилией, начинающейся на 'К':")
for person in people:
    if person["фамилия"].startswith("К"):
        print(person)

import random

people = {
    "person1": {"фамилия": "Иванов", "имя": "Иван", "отчество": "Иванович"},
    "person2": {"фамилия": "Петров", "имя": "Петр", "отчество": "Петрович"},
    "person3": {"фамилия": "Абрамов", "имя": "Александр", "отчество": "Александрович"},
    "person4": {"фамилия": "Сидоров", "имя": "Сидор", "отчество": "Сидорович"},
    "person5": {"фамилия": "Антонов", "имя": "Антон", "отчество": "Антонович"}
}

print("ФИО с фамилией, начинающейся 'А':")
for person, details in people.items():
    if details["фамилия"].startswith("А"):
        print(f"{person}: {details['фамилия']} {details['имя']} {details['отчество']}")


import random

people = {
    "person1": {"фамилия": "Иванов", "имя": "Иван", "отчество": "Иванович"},
    "person2": {"фамилия": "Петров", "имя": "Петр", "отчество": "Петрович"},
    "person3": {"фамилия": "Сидоров", "имя": "Сидор", "отчество": "Сидорович"},
    "person4": {"фамилия": "Антонов", "имя": "Антон", "отчество": "Антонович"},
    "person5": {"фамилия": "Козлов", "имя": "Константин", "отчество": "Константинович"}
}

letter = input("Введите букву для поиска: ")

print(f"ФИО с фамилией, начинающейся на '{letter}':")
for person, details in people.items():
    if details["фамилия"].startswith(letter):
        print(f"{person}: {details['фамилия']} {details['имя']} {details['отчество']}")
